Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/FRKE_old/FRKE_old.tmx
Source language: en_us
Languages: de_de

source: CLAIMS:
de_de: PATENTANSPRÜCHE

source: 1. A cooking grate (40) for use on a grill assembly, the cooking grate (40) comprising:
de_de: 1. Kochrost (40) zur Verwendung auf einer Grillbaugruppe, der Kochrost (40) umfassend:

source: a plurality of spaced apart rungs (42), each rung (42) having a first end (44) and a second end (45) located opposite the first end (44), the first and second ends (44, 45) defining a length, each rung (42) further having a bottom surface (47) having a downwardly facing concave shape forming a substantially hollow first channel along the length of each rung (42), wherein the cooking grate (40) further comprises:
de_de: eine Vielzahl von beabstandeten Sprossen (42), wobei jede Sprosse (42) ein erstes Ende (44) und ein zweites Ende (45) aufweist, das sich dem ersten Ende (44) gegenüberliegend befindet, wobei das erste und das zweite Ende (44, 45) eine Länge definieren, wobei jede Sprosse (42) ferner eine untere Fläche (47) mit einer nach unten gerichteten konkaven Form aufweist, die einen im Wesentlichen hohlen ersten Kanal entlang der Länge jeder Sprosse (42) bildet, wobei der Kochrost (40) ferner Folgendes umfasst:

source: a border (60) having a first border portion (61), a second border portion (62), and a third border portion (63) defining a substantially hollow, downwardly facing second channel (70), the third border portion (63) interconnecting the first border portion (61) and the second border portion (62), wherein the first end (44) of each rung (42) is joined to the first border portion (61) and the second end (45) of each rung (42) is joined to the second border portion (62) such that the first channel of each rung (42) is in fluid communication with the second channel (70) of the first border portion (61) and the second border portion (62);
de_de: einen Rand (60), der einen ersten Randabschnitt (61), einen zweiten Randabschnitt (62) und einen dritten Randabschnitt (63) aufweist, der einen im Wesentlichen hohlen, nach unten gerichteten zweiten Kanal (70) definiert, wobei der dritte Randabschnitt (63) den ersten Randabschnitt (61) und den zweiten Randabschnitt (62) miteinander verbindet, wobei das erste Ende (44) jeder Sprosse (42) mit dem ersten Randabschnitt (61) verbunden ist und das zweite Ende (45) jeder Sprosse (42) mit dem zweiten Randabschnitt (62) derart verbunden ist, dass der erste Kanal jeder Sprosse (42) in Fluidverbindung mit dem zweiten Kanal (70) des ersten Randabschnitts (61) und des zweiten Randabschnitts (62) ist;

source: a transverse cross member (50) having a bottom surface (52) defining a third channel, the transverse cross member (50) being coupled to the third border portion (63) such that the third channel of the transverse cross member (50) is in fluid communication with the second channel (70) of the third border portion (63); and characterized in having
de_de: eine querverlaufende Querstrebe (50), die eine untere Fläche (52) aufweist, die einen dritten Kanal definiert, wobei die querverlaufende Querstrebe (50) derart mit dem dritten Randabschnitt (63) verbunden ist, dass der dritte Kanal der querverlaufenden Querstrebe (50) in Fluidverbindung mit dem zweiten Kanal (70) des dritten Randabschnitts (63) ist; und dadurch gekennzeichnet, dass es

source: a plurality of feet (80) attached to a bottom surface of the border (60), wherein the feet (80) are configured to engage a ledge (20) of a firebox (10).
de_de: eine Vielzahl von Füßen (80) aufweist, die an einer unteren Fläche des Rands (60) angebracht sind, wobei die Füße (80) konfiguriert sind, um in eine Leiste (20) eines Feuerraums (10) einzugreifen.

source: 2. The cooking grate (40) of claim 1, wherein the third channel of the transverse cross member (50) is in fluid communication with the first channel of each rung (42).
de_de: 2. Kochrost (40) nach Anspruch 1, wobei der dritte Kanal der querverlaufenden Querstrebe (50) in Fluidverbindung mit dem ersten Kanal jeder Sprosse (42) ist.

source: 3. The cooking grate (40) of claim 1, wherein the first border portion (61), the second border portion (62), and the third border portion (63) each include an upper surface (65) that slopes downwardly from an outside edge (66) of the border portion (61, 62, 63) toward the center of the cooking grate (40).
de_de: 3. Kochrost (40) nach Anspruch 1, wobei der erste Randabschnitt (61), der zweite Randabschnitt (62) und der dritte Randabschnitt (63) jeweils eine obere Fläche (65) beinhalten, die von einer Außenkante (66) des Randabschnitts (61, 62, 63) zu der Mitte des Kochrosts (40) hin nach unten abgeschrägt ist.

source: 4. The cooking grate (40) of claim 1, wherein the first border portion (61), the second border portion (62), and the third border portion (63) each include an outer leg (67) that extends downwardly from an outer edge (66), the upper surface (65) and the outer leg (67) forming the second channel (70).
de_de: 4. Kochrost (40) nach Anspruch 1, wobei der erste Randabschnitt (61), der zweite Randabschnitt (62) und der dritte Randabschnitt (63) jeweils einen Außenschenkel (67) beinhalten, der sich von einer äußeren Kante (66) nach unten erstreckt, wobei die obere Fläche (65) und der äußere Schenkel (67) den zweiten Kanal (70) bilden.

source: 5. The cooking grate (40) of claim 1, wherein the bottom surface (47) of each rung (42) has a cross-sectional shape forming the first channel, the cross-sectional shape being a downwardly facing, generally concave shape having bottom edges (48).
de_de: 5. Kochrost (40) nach Anspruch 1, wobei die untere Fläche (47) jeder Sprosse (42) eine Querschnittsform aufweist, die den ersten Kanal bildet, wobei die Querschnittsform eine nach unten gerichtete, allgemein konkave Form mit Bodenkanten (48) ist.

source: 6. The cooking grate (40) of claim 1, wherein the feet (80) are configured to keep the border (60) from contacting the ledge (20) around an entire perimeter of the ledge (20) and the border (60).
de_de: 6. Kochrost (40) nach Anspruch 1, wobei die Füße (80) konfiguriert sind, um den Rand (60) davon abhalten, die Leiste (20) über einen gesamten Umfang der Leiste (20) und des Randes (60) zu berühren.

source: 7. The cooking grate (40) of claim 1, wherein the feet (80) are configured to space the second channel (70) of the border (60) away from the ledge (20) to increase airflow to the second channel (70) of the border (60).
de_de: 7. Kochrost (40) nach Anspruch 1, wobei die Füße (80) konfiguriert sind, um den zweiten Kanal (70) des Randes (60) von der Leiste (20) zu beabstanden, um einen Luftstrom zu dem zweiten Kanal (70) des Randes (60) zu erhöhen.

source: 8. A grill assembly comprising a firebox (10) having a rim (21), a bottom wall (18), a front wall (17), and a back wall (16), the bottom wall (18) of the firebox (10) having an opening (19), a heating element (12) located near the bottom of the firebox (10), and at least one cooking grate (40) as claimed in any of claims 1 to 7.
de_de: 8. Grillbaugruppe, umfassend einen Feuerraum (10), der eine Begrenzung (21), eine Bodenwand (18), eine Vorderwand (17) und eine Rückwand (16) umfasst, wobei die Bodenwand (18) des Feuerraums (10) eine Öffnung (19), ein Heizelement (12), das sich in der Nähe des Bodens des Feuerraums (10) befindet, und mindestens einen Kochrost (40) nach einem der Ansprüche 1 bis 7 aufweist.

source: 9. A grill assembly according to claim 8 comprising a plurality of the cooking grates (40) provided to form a cooking surface (41) of the grill assembly.
de_de: 9. Grillbaugruppe nach Anspruch 8, umfassend eine Vielzahl von Kochrosten (40), die bereitgestellt sind, um eine Kochfläche (41) der Grillbaugruppe zu bilden.

source: 1. A non-volatile synaptic circuit (300), comprising:
de_de: 1. Nichtflüchtige Synapsenschaltung (300), umfassend:

source: a first input signal line (265) for providing a first input signal (202);
de_de: eine erste Eingangssignalleitung (265) zum Bereitstellen eines ersten Eingangssignals (202);

source: a reference signal line (264) for providing a reference signal (201);
de_de: eine Referenzsignalleitung (264) zum Bereitstellen eines Referenzsignals (201);

source: first and second output lines (266,267) for carrying first and second output signals therethrough; and
de_de: erste und zweite Ausgangsleitungen (266, 267) zum Durchführen erster und zweiter Ausgangssignale dadurch; und

source: first and second cells (332,334) for generating the first and second output signals, respectively, each of the first and second cells including:
de_de: erste und zweite Zelle (332, 334) zum Erzeugen des ersten und zweiten Ausgangssignals, wobei jede der ersten und zweiten Zellen folgendes beinhaltet:

source: first upper select transistors (311, 312), respectively, having a gate that is electrically coupled to the first input signal line (265); and
de_de: erste obere Auswahltransistoren (311, 312), jeweils mit einem Gate, das elektrisch mit der ersten Eingangssignalleitung (265) gekoppelt ist; und

source: first variable resistors (313,314), respectively, having one end connected to the first upper select transistors (311,312) in series and another end electrically coupled to the reference signal line (264), a value of the first variable resistors (313, 314) being programmable to change a magnitude of an output signal,
de_de: erste variable Widerstände (313, 314), deren eines Ende mit den ersten oberen Auswahltransistoren (311, 312) in Reihe verbunden ist und deren anderes Ende elektrisch mit der Referenzsignalleitung (264) gekoppelt ist, wobei ein Wert der ersten variablen Widerstände (313, 314) programmierbar ist, um eine Größe eines Ausgangssignals zu ändern,

source: wherein a drain of the first upper select transistor (311) of the first cell (332) is electrically coupled to the first output line (266) and a drain of the first upper select transistor (312) of the second cell (334) is electrically coupled to the second output line (267); and
de_de: wobei ein Drain des ersten oberen Auswahltransistors (311) der ersten Zelle (332) elektrisch mit der ersten Ausgangsleitung (266) gekoppelt ist und ein Drain des ersten oberen Auswahltransistors (312) der zweiten Zelle (334) elektrisch mit der zweiten Ausgangsleitung (267) gekoppelt ist; und

source: wherein the first upper select transistors (311, 312) are configured to have gates respectively connected to the first input signal line (265) to be operative responding to the first input signal (202);
de_de: wobei die ersten oberen Auswahltransistoren (311, 312) konfiguriert sind, um Gates aufzuweisen, die jeweils mit der ersten Eingangssignalleitung (265) verbunden sind, um auf das erste Eingangssignal (202) zu reagieren;

source: characterized in that the non-volatile synaptic circuit (500) further comprises:
de_de: dadurch gekennzeichnet, dass die nichtflüchtige Synapsenschaltung (500) ferner umfasst:

source: a second input signal line for providing a second input signal,
de_de: eine zweite Eingangssignalleitung zum Bereitstellen eines zweiten Eingangssignals,

source: wherein each of the first and second cells (532,534) further includes:
de_de: wobei jede der ersten und zweiten Zellen (532, 534) ferner beinhaltet:

source: second upper select transistors, respectively, having a gate that is electrically coupled to the second input signal line; and
de_de: zweite obere Auswahltransistoren, die jeweils ein Gate aufweisen, das elektrisch mit der zweiten Eingangssignalleitung gekoppelt ist; und

source: second variable resistors, respectively, having one end connected to the second upper select transistor in series and another end electrically coupled to the reference signal line, a value of the second variable resistors being programmable to change a magnitude of an output signal,
de_de: zweite variable Widerstände, die ein Ende aufweisen, das in Reihe mit dem zweiten oberen Auswahltransistor verbunden ist, und ein anderes Ende, das elektrisch mit der Referenzsignalleitung gekoppelt ist, wobei ein Wert der zweiten variablen Widerstände programmierbar ist, um eine Größe eines Ausgangssignals zu ändern,

source: wherein a drain of the second upper select transistor of the first cell (532) is electrically coupled to the first output line and a drain of the second upper select transistor of the second cell (534) is electrically coupled to the second output line.
de_de: wobei ein Drain des zweiten oberen Auswahltransistors der ersten Zelle (532) elektrisch mit der ersten Ausgangsleitung gekoppelt ist und ein Drain des zweiten oberen Auswahltransistors der zweiten Zelle (534) elektrisch mit der zweiten Ausgangsleitung gekoppelt ist.

source: 2. The non-volatile synaptic circuit of claim 1, wherein the first output signal (1212) is a sum of a first current signal (1224) and an offset current signal (1220), the second output signal (1214) is a sum of a second current signal (1226) and the offset current signal (1220), and the first current signal has an opposite polarity to the second current signal.
de_de: 2. Nichtflüchtige Synapsenschaltung nach Anspruch 1, wobei das erste Ausgangssignal (1212) eine Summe aus einem ersten Stromsignal (1224) und einem Versatzstromsignal (1220) ist, das zweite Ausgangssignal (1214) eine Summe aus einem zweiten Stromsignal (1226) und dem Versatzstromsignal (1220) ist und das erste Stromsignal eine entgegengesetzte Polarität zu dem zweiten Stromsignal aufweist.

source: 3. The non-volatile synaptic circuit of claim 1, wherein the first variable resistor (313) stores a programmable weight value associated with a cell; or
de_de: 3. Nichtflüchtige Synapsenschaltung nach Anspruch 1, wobei der erste variable Widerstand (313) einen programmierbaren Gewichtungswert speichert, der einer Zelle zugeordnet ist; oder

source: wherein the first variable resistor is programmed to have a resistance value higher than a preset value,
de_de: wobei der erste variable Widerstand so programmiert ist, dass er einen Widerstandswert aufweist, der höher ist als ein voreingestellter Wert,

source: wherein, the magnitude of the output signal is substantially zero.
de_de: wobei die Größe des Ausgangssignals im Wesentlichen Null ist.

source: 4. A non-volatile neural network (100), comprising:
de_de: 4. Nichtflüchtiges neuronales Netz (100), umfassend:

source: a first neural array layer (110) including a first plurality of neurons (112a,…,112n);
de_de: eine erste neuronale Array-Schicht (110) einschließlich einer ersten Vielzahl von Neuronen (112a,…,112n);

source: a second neural array layer (130) including a second plurality of neurons (132a,…,132m); and
de_de: eine zweite neuronale Array-Schicht (130) einschließlich einer zweiten Vielzahl von Neuronen (132a,…,132m); und

source: a synapse array layer (120) disposed between the first and second neural array layers (110,130) and including a plurality of non-volatile synaptic circuit as defined in claim 1,
de_de: eine Synapsenarray-Schicht (120), die zwischen der ersten und zweiten neuronalen Array-Schicht (110, 130) angeordnet ist und eine Vielzahl von nichtflüchtigen Synapsenschaltungen wie in Anspruch 1 definiert beinhaltet,

source: wherein each of the non-volatile synaptic circuits in the synapse array layer is electrically coupled to a neuron of the first plurality of neurons and to one or more neurons of the second plurality of neurons, and includes: a first input signal line for receiving a first input signal from a neuron in the first plurality of neurons; a reference signal line for providing a reference signal; first and second output lines for carrying first and second output signals therethrough, the first and second output signals being processed and transmitted to one or more neurons of the second plurality of neurons; and first and second cells for generating the first and second output signals, respectively.
de_de: wobei jede der nichtflüchtigen Synapsenschaltungen in der Synapsenarray-Schicht elektrisch mit einem Neuron der ersten Vielzahl von Neuronen und mit einem oder mehreren Neuronen der zweiten Vielzahl von Neuronen gekoppelt ist und Folgendes beinhaltet: eine erste Eingangssignalleitung zum Empfangen eines ersten Eingangssignals von einem Neuron in der ersten Vielzahl von Neuronen; eine Referenzsignalleitung zum Bereitstellen eines Referenzsignals; eine erste und zweite Ausgangsleitung zum Durchführen einer erster und zweiter Ausgangssignale dadurch, wobei das erste und zweite Ausgangssignal verarbeitet und an ein oder mehrere Neuronen der zweiten Vielzahl von Neuronen übertragen werden; und eine erste und zweite Zelle zum Erzeugen des ersten und zweiten Ausgangssignals.

source: 5. The non-volatile neural network of claim 4, wherein the non-volatile synaptic circuit further includes:
de_de: 5. Nichtflüchtiges neuronales Netz nach Anspruch 4, wobei die nichtflüchtige Synapsenschaltung ferner beinhaltet:

source: a program line (418) for providing a programming signal;
de_de: eine Programmierleitung (418) zum Bereitstellen eines Programmsignals;

source: a write line (416) for providing a writing signal; and
de_de: eine Schreibleitung (416) zum Bereitstellen eines Schreibsignals; und

source: an erase line (414) for providing an erasing signal;
de_de: eine Löschleitung (414) zum Bereitstellen eines Löschsignals;

source: wherein the first variable resistor (452) includes:
de_de: wobei der erste variable Widerstand (452) Folgendes beinhaltet:

source: coupling and write transistors (422, 424) arranged to have a floating gate node, the coupling transistor (422) electrically coupled to the program line (418), the write transistor (424) being electrically coupled to the write line (416); and
de_de: Kopplungs- und Schreibtransistoren (422, 424), die so angeordnet sind, dass sie einen schwebenden Gate-Knoten aufweisen, wobei der Kopplungstransistor (422) elektrisch mit der Programmierleitung (418) gekoppelt ist und der Schreibtransistor (424) elektrisch mit der Schreibleitung (416) gekoppelt ist; und

source: a read transistor (462) and a lower select transistor (464) that are arranged in series with the first upper select transistor (460), the lower select transistor (464) having a source electrically coupled to the reference signal line (412) and a gate electrically coupled to the erase line (414), the read transistor (462) having a gate electrically coupled to the floating gate node; or
de_de: einen Lesetransistor (462) und einen unteren Auswahltransistor (464), die in Reihe mit dem ersten oberen Auswahltransistor (460) angeordnet sind, wobei der untere Auswahltransistor (464) eine Quelle aufweist, die elektrisch mit der Referenzsignalleitung (412) gekoppelt ist, und ein Gate, das elektrisch mit der Löschleitung (414) gekoppelt ist, wobei der Lesetransistor (462) ein Gate aufweist, das elektrisch mit dem schwebenden Gate-Knoten gekoppelt ist; oder

source: wherein the non-volatile synaptic circuit further includes:
de_de: wobei die nichtflüchtige Synapsenschaltung ferner beinhaltet:

source: a second input signal line for providing a second input signal;
de_de: eine zweite Eingangssignalleitung zum Bereitstellen eines zweiten Eingangssignals;

source: wherein each of the first and second cells (532, 534) further includes:
de_de: wobei jede der ersten und zweiten Zellen (532, 534) ferner Folgendes beinhaltet:

source: a second upper select transistor having a gate that is electrically coupled to the second input signal; and
de_de: einen zweiten oberen Auswahltransistor, das ein Gate aufweist, das elektrisch mit dem zweiten Eingangssignal gekoppelt ist; und

source: a second variable resistor having one end connected to the second select transistor in series and another end electrically coupled to the reference signal line, a value of the second select transistor being adjustable to change a magnitude of an output signal,
de_de: einen zweiten variablen Widerstand, der ein Ende aufweist, das in Reihe mit dem zweiten Auswahltransistor verbunden ist und ein anderes Ende, das elektrisch mit der Referenzsignalleitung gekoppelt ist, wobei ein Wert des zweiten Auswahltransistors einstellbar ist, um eine Größe eines Ausgangssignals zu ändern,

source: 6. The non-volatile neural network of claim 4, wherein the non-volatile synaptic circuit further includes:
de_de: 6. Nichtflüchtiges neuronales Netz nach Anspruch 4, wobei die nichtflüchtige Synapsenschaltung ferner Folgendes beinhaltet:

source: wherein each of first and second cells (632, 634) further includes:
de_de: wobei jede der ersten und zweiten Zellen (632, 634) ferner Folgendes beinhaltet:

source: a second upper select transistor (606 or 608) having a gate that is electrically coupled to the second input signal line; and
de_de: einen zweiten oberen Auswahltransistor (606 oder 608) , der ein Gate aufweist, das elektrisch mit der zweiten Eingangssignalleitung gekoppelt ist; und

source: the second upper select transistor having a source that is electrically coupled to the first variable resistor (613 or 614), the source of the first upper select transistor and the source of the second upper select transistor being directly connected a first common node,
de_de: der zweite obere Auswahltransistor eine Quelle aufweist, die elektrisch mit dem ersten variablen Widerstand (613 oder 614) gekoppelt ist, wobei die Quelle des ersten oberen Auswahltransistors und die Quelle des zweiten oberen Auswahltransistors direkt mit einem ersten gemeinsamen Knotenpunkt verbunden sind,

source: wherein a drain of the second upper select transistor (606) of the first cell (632) is electrically coupled to the second output line and a drain of the second upper select transistor (608) of the second cell (634) is electrically coupled to the first output line.
de_de: wobei ein Drain des zweiten oberen Auswahltransistors (606) der ersten Zelle (632) elektrisch mit der zweiten Ausgangsleitung gekoppelt ist und ein Drain des zweiten oberen Auswahltransistors (608) der zweiten Zelle (634) elektrisch mit der ersten Ausgangsleitung gekoppelt ist.

source: 7. The non-volatile neural network of claim 6, wherein the non-volatile synaptic circuit further includes:
de_de: 7. Nichtflüchtiges neuronales Netz nach Anspruch 6, wobei die nichtflüchtige Synapsenschaltung ferner beinhaltet:

source: a program line for providing a programming signal;
de_de: eine Programmierleitung zum Bereitstellen eines Programmsignals;

source: a write line for providing a writing signal; and
de_de: eine Schreibleitung zum Bereitstellen eines Schreibsignals; und

source: an erase line for providing an erasing signal;
de_de: eine Löschleitung zum Bereitstellen eines Löschsignals;

source: wherein the first variable resistor (752) includes:
de_de: wobei der erste variable Widerstand (752) Folgendes beinhaltet:

source: coupling and write transistors arranged to have a floating gate node, the coupling transistor electrically coupled to the program line, the write transistor being electrically coupled to the write line; and
de_de: Kopplungs- und Schreibtransistoren, die so angeordnet sind, dass sie einen schwebenden Gate-Knoten aufweisen, wobei der Kopplungstransistor elektrisch mit der Programmierleitung gekoppelt ist und der Schreibtransistor elektrisch mit der Schreibleitung gekoppelt ist; und
